app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    #@all_ratings = Movie.ratings
    if params[:sort_by] == 'title'
      @movies = Movie.order 'title'