app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index
    @all_ratings = Movie.ratings
    @checked_rating = params[:ratings] || {}

    if params[:sort_by] == 'title'
      order = {:order => :title}
      @title_style = 'hilite'
    end
    if params[:sort_by] == 'release_date'
      order = {:order => :release_date}
      @release_style = 'hilite'
    end
    @movies = Movie.find_all_by_rating(@checked_rating.keys, order)